
import Mathlib.Tactic

variable (A B : Type) [Ring A] [Ring B]


example : Type :=
  A ≃+* B

--------------------------------------------------------------------------------

example (φ : A ≃+* B) (a : A) : B :=
  φ a

--------------------------------------------------------------------------------

example (φ : A ≃+* B) (x y : A) : φ (x + y) = φ x + φ y :=
  map_add φ x y

--------------------------------------------------------------------------------

variable (C : Type) [Ring C]


example (φ : A ≃+* B) (ψ : B ≃+* C) : A ≃+* C :=
  φ.trans ψ

--------------------------------------------------------------------------------

example (φ : A →+* B) (ψ : B →+* A) (h1 : ∀ a, ψ (φ a) = a) (h2 : ∀ b, φ (ψ b) = b) : A ≃+* B :=
  { toFun := φ
    invFun := ψ
    left_inv := h1
    right_inv := h2
    map_add' := φ.map_add
    map_mul' := φ.map_mul }

--------------------------------------------------------------------------------

example (φ : A ≃+* B) (x y : B) : φ.symm (x * y) = φ.symm x * φ.symm y :=
  map_mul φ.symm x y
